# 06 - Combining datasets

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import numpy as np 
import pandas as pd 
import random

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
first = np.random.randint(1,4,100)
second = np.random.randint(1,3,100)
third = np.random.randint(10000,30000,100)

In [4]:
first = pd.Series(first)
second = pd.Series(second)
third = pd.Series(third)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [5]:
df = pd.concat([first, second, third], axis=1)
df

    0  1      2
0   2  1  27645
1   1  2  23082
2   1  1  21227
3   3  2  15247
4   1  2  19438
.. .. ..    ...
95  3  2  29046
96  3  2  23790
97  2  2  21911
98  3  2  12588
99  3  2  25330

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [6]:
df = df.rename(columns = {0:"bedrs", 1: "bathrs", 2:"price_sqr_meter"})
df

    bedrs  bathrs  price_sqr_meter
0       2       1            27645
1       1       2            23082
2       1       1            21227
3       3       2            15247
4       1       2            19438
..    ...     ...              ...
95      3       2            29046
96      3       2            23790
97      2       2            21911
98      3       2            12588
99      3       2            25330

[100 rows x 3 columns]

### Step 5. Create a column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [9]:
bigcolumn = pd.concat([first,second,third])
bigcolumn = bigcolumn.to_frame()
bigcolumn

        0
0       2
1       1
2       1
3       3
4       1
..    ...
95  29046
96  23790
97  21911
98  12588
99  25330

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [20]:
bigcolumn.iloc[50:158]

     0
50   1
51   1
52   3
53   2
54   3
..  ..
153  1
154  1
155  2
156  1
157  1

[108 rows x 1 columns]

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [13]:
bigcolumn.reset_index(drop=True, inplace=True)

In [14]:
bigcolumn.index.values

array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
        13,  14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,
        26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
        39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,
        52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,
        65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,
        78,  79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,
        91,  92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103,
       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116,
       117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
       130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
       143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
       156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168,
       169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181,
       182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194,
       195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207,
       208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220,
       221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233,
       234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246,
       247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259,
       260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272,
       273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285,
       286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298,
       299], dtype=int64)